In [46]:
import pandas as pd
import numpy as np
# import pymysql
from sqlalchemy import create_engine

In [9]:
#准备数据
df = pd.DataFrame(np.random.rand(10,4))

In [36]:
# 准备数据
df1 = pd.DataFrame({'name':['张三','李四','王五','赵六'],'group1':['DBA','PM','PM','HR']})
df2 = pd.DataFrame({'name':['李四','赵六','张三','王五'],'date':[2004,2008,2012,2014]})

In [37]:
df_m = pd.merge(df1,df2)

In [38]:
df_m

  name group1  date
0   张三    DBA  2012
1   李四     PM  2004
2   王五     PM  2014
3   赵六     HR  2008

In [53]:
engine = create_engine('mysql+pymysql://root:lf@localhost:3306/my_mysql')

In [54]:
df_m.to_sql('tmp',engine,if_exists='replace',index=False)

In [58]:
pd.read_sql('select * from tmp',engine)

  name group1  date
0   张三    DBA  2012
1   李四     PM  2004
2   王五     PM  2014
3   赵六     HR  2008